#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/james-personal-account/aws-nuclei/runs/run-4vPrqHkGbqpLo6ue

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
data.aws_region.current: Reading...
aws_lambda_layer_version.boto3_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:847035122536:layer:boto3_layer:4]
data.aws_caller_identity.current: Reading...
aws_default_vpc.default: Refreshing state... [id=vpc-00316a594b8442850]
aws_apigatewayv2_api.lambda: Refreshing state... [id=mnn47ekvw8]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_sqs_queue.crawled_urls: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/847035122536/crawled_urls]
data.aws_region.current: Read complete after 0s [id=us-west-2]
aws_default_subnet.default_az1: Refreshing state... [id=subnet-0e9b3892f4f02491c]
aws_iam_role.crawler_role: Refreshing state... [id=crawler_role]
aws_eip.natgw_eip: Refreshing state... [id=eipalloc-0caa4fb94cb4971d9]
aws_efs_file_system.nuclei_efs: Refreshing state... [id=fs-00cd02fe9fbaf7a9a]
data.aws_caller_identity.current: Read complete after 0s [id=847035122536]
aws_iam_role.scanner_role: Refreshing state... [id=scanner_role]
aws_iam_role.db_init_role: Refreshing state... [id=db_init_role]
aws_iam_policy.rds_connect_policy: Refreshing state... [id=arn:aws:iam::847035122536:policy/rds_connect_policy]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-07e4aca6461e65ec9]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_iam_policy.sqs_publish_policy: Refreshing state... [id=arn:aws:iam::847035122536:policy/sqs_publish_policy]
aws_efs_access_point.nuclei_efs_access_point: Refreshing state... [id=fsap-09706ceeb283da7f4]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220620061502436700000002]
aws_lambda_function.test_lambda: Refreshing state... [id=hello_world]
aws_iam_role_policy_attachment.crawler_policy_attach_lambda_basic: Refreshing state... [id=crawler_role-20220620061502490300000004]
aws_lambda_function.crawler: Refreshing state... [id=crawler]
aws_iam_role_policy_attachment.crawler_policy_attach_readonly: Refreshing state... [id=crawler_role-20220620061502536700000005]
aws_iam_role_policy_attachment.crawler_policy_attach_sqs_publish: Refreshing state... [id=crawler_role-2022062006152872580000000a]
aws_iam_role_policy_attachment.scanner_policy_attach_efs_access: Refreshing state... [id=scanner_role-20220620061502561500000006]
aws_iam_role_policy_attachment.scanner_policy_attach_vpc_access: Refreshing state... [id=scanner_role-20220620061502565800000007]
aws_iam_role_policy_attachment.scanner_policy_attach_sqs_execution: Refreshing state... [id=scanner_role-20220620061502598600000008]
aws_iam_role_policy_attachment.scanner_policy_attach_lambda_basic: Refreshing state... [id=scanner_role-20220620061502637000000009]
aws_iam_role_policy_attachment.scanner_policy_attach_rds_access: Refreshing state... [id=scanner_role-2022062006160985230000000d]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_function_url.test_live: Refreshing state... [id=hello_world]
aws_cloudwatch_log_group.test_lambda: Refreshing state... [id=/aws/lambda/hello_world]
aws_apigatewayv2_integration.test_lambda: Refreshing state... [id=sch06ac]
aws_iam_role_policy_attachment.db_init_policy_attach_lambda_basic: Refreshing state... [id=db_init_role-20220620061502455000000003]
aws_iam_role_policy_attachment.db_init_policy_attach_vpc_access: Refreshing state... [id=db_init_role-20220620063822236700000001]
aws_iam_role_policy_attachment.db_init_policy_attach_rds_access: Refreshing state... [id=db_init_role-2022062006160984810000000c]
aws_cloudwatch_log_group.crawler: Refreshing state... [id=/aws/lambda/crawler]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_apigatewayv2_route.test_lambda: Refreshing state... [id=vugmn2e]
aws_subnet.private_az1: Refreshing state... [id=subnet-052b710a3fb7476e2]
aws_route_table.private_rt: Refreshing state... [id=rtb-0ace0b8eb6a658e94]
aws_default_security_group.default: Refreshing state... [id=sg-0dfa3e4d75f7cdb3a]
aws_subnet.private_az2: Refreshing state... [id=subnet-043ce8e346211a36c]
aws_route_table_association.subnet1_rt: Refreshing state... [id=rtbassoc-0b3085b17975cec92]
aws_route_table_association.subnet2_rt: Refreshing state... [id=rtbassoc-0c55e3ecdf6c3fc2c]
aws_db_subnet_group.private: Refreshing state... [id=private]
aws_efs_mount_target.nuclei_efs_mount_target2: Refreshing state... [id=fsmt-036f87c58caef165e]
aws_efs_mount_target.nuclei_efs_mount_target1: Refreshing state... [id=fsmt-059c1446d54fbf482]
aws_lambda_function.db_init: Refreshing state... [id=db_init]
aws_lambda_invocation.db_init: Refreshing state... [id=db_init_$LATEST_1530accf30cab891d759fa3cb8322250]
aws_cloudwatch_log_group.db_init: Refreshing state... [id=/aws/lambda/db_init]
aws_lambda_function.scanner: Refreshing state... [id=scanner]
aws_cloudwatch_log_group.scanner: Refreshing state... [id=/aws/lambda/scanner]
aws_lambda_event_source_mapping.example: Refreshing state... [id=7da72925-389e-4ed5-b750-bd763143d6b4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_db_subnet_group.public will be created
  + resource "aws_db_subnet_group" "public" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "public"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-0e9b3892f4f02491c",
        ]
      + tags        = {
          + "Name" = "My public DB subnet group"
        }
      + tags_all    = {
          + "Name" = "My public DB subnet group"
        }
    }

  # aws_default_subnet.default_az2 will be created
  + resource "aws_default_subnet" "default_az2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = (known after apply)
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + existing_default_subnet                        = (known after apply)
      + force_destroy                                  = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_iam_policy.rds_connect_policy will be updated in-place
  ~ resource "aws_iam_policy" "rds_connect_policy" {
        id          = "arn:aws:iam::847035122536:policy/rds_connect_policy"
        name        = "rds_connect_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = "rds-db:connect" -> [
                          + "rds-db:connect",
                        ]
                      ~ Resource = [
                          - "arn:aws:rds-db:us-west-2:847035122536:dbuser:*/*",
                        ] -> "arn:aws:rds-db:us-west-2:847035122536:dbuser:*/test"
                      - Sid      = "VisualEditor0" -> null
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.crawler will be updated in-place
  ~ resource "aws_lambda_function" "crawler" {
        id                             = "crawler"
      ~ last_modified                  = "2022-06-21T08:11:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "zo380rL0rX7jx2HvMb3cJ/g0Exgtu/GkZbHGIgERQ/k=" -> "sNmg+ROUs21Oy4V5E1LJxPYNHnNlChh+SrBZzT02jZc="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.db_init will be updated in-place
  ~ resource "aws_lambda_function" "db_init" {
        id                             = "db_init"
      ~ last_modified                  = "2022-06-21T07:36:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "9frcsUGFeMwY8kklx5mtEZavfRXNYUGabHv6+b8z1RE=" -> "fhmqjFOUNv87jQ1vvOlRVCc585wMwetLaQBmPKlfUfg="
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "APP_DB_NAME" = "vuln_db"
              - "DB_HOST"     = "vuln-db-cluster.cluster-ci1sahf4rlmb.us-west-2.rds.amazonaws.com"
              - "DB_USER"     = "test"
            } -> (known after apply)
        }



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.scanner will be updated in-place
  ~ resource "aws_lambda_function" "scanner" {
        id                             = "scanner"
      ~ last_modified                  = "2022-06-21T03:54:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "32m1bnif7aqgQFBntl3MV0ZkXfy9Di/SM48x08yfxUo=" -> "s31uKtemeWTjj1TJC4DUUSK9aUwrBD2Gc5fBY+FiZbk="
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "APP_DB_NAME" = "vuln_db"
              - "DB_HOST"     = "vuln-db-cluster.cluster-ci1sahf4rlmb.us-west-2.rds.amazonaws.com"
              - "DB_USER"     = "test"
              - "HOME"        = "/tmp/"
              - "mountPath"   = "/mnt/nuclei"
              - "nucleiUrl"   = "https://github.com/projectdiscovery/nuclei/releases/download/v2.7.2/nuclei_2.7.2_linux_amd64.zip"
              - "sqsUrl"      = "https://sqs.us-west-2.amazonaws.com/847035122536/crawled_urls"
            } -> (known after apply)
        }




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
        id                             = "hello_world"
      ~ last_modified                  = "2022-06-21T08:10:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "6f7in1HZMpKyJq+Gd1sQJpS/5krmUWvQ5xwWZlsURls=" -> "SUutbIToZmgEDGvCw7i3zOc+DjNh65dC8ibOS+iYB/w="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_rds_cluster.vuln_db_cluster will be created
  + resource "aws_rds_cluster" "vuln_db_cluster" {
      + allocated_storage                   = (known after apply)
      + apply_immediately                   = true
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backup_retention_period             = 0
      + cluster_identifier                  = "vuln-db-cluster"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = false
      + database_name                       = "vuln_db"
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = (known after apply)
      + enable_global_write_forwarding      = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-postgresql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "13.6"
      + engine_version_actual               = (known after apply)
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = true
      + iam_roles                           = (known after apply)
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = "test"
      + port                                = (known after apply)
      + preferred_backup_window             = (known after apply)
      + preferred_maintenance_window        = (known after apply)
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = true
      + storage_encrypted                   = (known after apply)
      + tags_all                            = (known after apply)
      + vpc_security_group_ids              = (known after apply)

      + serverlessv2_scaling_configuration {
          + max_capacity = 1
          + min_capacity = 0.5
        }
    }

  # aws_rds_cluster_instance.vuln_db_instance will be created
  + resource "aws_rds_cluster_instance" "vuln_db_instance" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "13.6"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)
    }

Plan: 4 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  ~ rds_arn = "arn:aws:rds:us-west-2:847035122536:cluster:vuln-db-cluster/test" -> (known after apply)

```

</details>

*Pushed by: @Jamolo5, Action: `pull_request`*